balazsgrill/modembed/res/Devices/dsPIC30/PIC24F16KA302.PIC
        <edc:SFRDef edc:access="-------nn--nnnnn" edc:cname="DSWAKE" edc:desc="" edc:impl="0x19d" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------uu--uu1uu" edc:name="DSWAKE" edc:nzwidth="0x10" edc:por="-------00--00001">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="DSWSRC"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSPOR" edc:desc="" edc:mask="0x1" edc:name="DSPOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DSICD" edc:desc="Deep Sleep Wake up Source = ICD (In Circuit Debugger)" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="DSICD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DSMCLR" edc:desc="" edc:mask="0x1" edc:name="DSMCLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DSRTCC" edc:desc="" edc:mask="0x1" edc:name="DSRTCC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DSWDT" edc:desc="" edc:mask="0x1" edc:name="DSWDT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DSFLT" edc:desc="" edc:mask="0x1" edc:name="DSFLT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DSINT0" edc:desc="" edc:mask="0x1" edc:name="DSINT0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DSGPR0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="DSGPR0" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSGPR0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DSGPR0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DSGPR1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="DSGPR1" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSGPR1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="DSGPR1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="snnn-----nnnnnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe04f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-----0xxxxxx" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="0000-----0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0x3f" edc:name="NVMOP" edc:nzwidth="6"/>
              <edc:SFRFieldDef edc:cname="ERASE" edc:desc="" edc:mask="0x1" edc:name="ERASE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="PGMONLY" edc:desc="" edc:mask="0x1" edc:name="PGMONLY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMOP0" edc:desc="" edc:mask="0x1" edc:name="NVMOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP1" edc:desc="" edc:mask="0x1" edc:name="NVMOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP2" edc:desc="" edc:mask="0x1" edc:name="NVMOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP3" edc:desc="" edc:mask="0x1" edc:name="NVMOP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP4" edc:desc="" edc:mask="0x1" edc:name="NVMOP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMOP5" edc:desc="" edc:mask="0x1" edc:name="NVMOP5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4"/>
        <edc:SFRDef edc:access="--------wwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="NVMKEY" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:mask="0xff" edc:name="NVMKEY" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NVMKEY0" edc:desc="" edc:mask="0x1" edc:name="NVMKEY0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY1" edc:desc="" edc:mask="0x1" edc:name="NVMKEY1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY2" edc:desc="" edc:mask="0x1" edc:name="NVMKEY2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY3" edc:desc="" edc:mask="0x1" edc:name="NVMKEY3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY4" edc:desc="" edc:mask="0x1" edc:name="NVMKEY4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY5" edc:desc="" edc:mask="0x1" edc:name="NVMKEY5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY6" edc:desc="" edc:mask="0x1" edc:name="NVMKEY6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NVMKEY7" edc:desc="" edc:mask="0x1" edc:name="NVMKEY7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
